# AddInCommandBinding Events

---
The AddInCommandBinding type exposes the following members.
| Name| Description
---|---|---
| BeforeExecuted| Occurs before the command associated with this AddInCommandBinding executes.
| CanExecute| Occurs when the command associated with this AddInCommandBinding initiates a check to determine whether the command can be executed on the command target.
| Executed| Occurs when the command associated with this AddInCommandBinding executes.
Top
#### Reference
AddInCommandBinding Class
Autodesk.Revit.UI Namespace